

# パッケージの読み込み --------------------------------------------------------------
require(tidyverse)
require(ggplot2)



# ディレクトリの設定 ---------------------------------------------------------
setwd("/Users/Yuki/stats2")


# データの読み込み ----------------------------------------------------------------
# csvを読み込み，seedというオブジェクト名を付ける
seed = read.csv("data_text2.csv", fileEncoding = "CP932")



# seedの中身を表示させてみよう ----------------------------------------------------------------



# 基本統計量の算出 ----------------------------------------------------------------
# 要約統計量の計算はsummary()



# 種子数と体長の関係を散布図で表す -------------------------------------------------------------------------



# 肥料の有無に分けて，箱ひげ図を作成する ------------------------------------------------------



# モデル1を推定する -------------------------------------------------------------
fit1 = glm(y ~ x, data = seed, family = poisson(link = "log"))
summary(fit1)

# 最大対数尤度
logLik(fit1)



# モデル2を推定する -------------------------------------------------------------



# モデル3を推定する ------------------------------------------------------